- 네트워크 참여자 여부에 따라 퍼블릭, 프라이빗으로 나뉨

- 머클트리(해시트리) : 트리 구조로 구성

- 제네시스 블록 : 첫번째 블록(트리의 루트에 해당)

- 블록헤더 : 머클루트, 난이도, 거래 정보 등 주요 데이터 담고 있음

- DApp : 중앙화 된 서버가 필요하지 않음 탈중화된 기술

  스마트컨트랙트 + 스마트컨트랙트 프로세서를 휴대폰으로 사용할 수 있게 하는 것

  기존의 서버-클라이언트-네트워크 구조가 아닌 네트워크들끼리 구성

  네트워크 어디든 붙어도 상관없음

- 스테이블 코인 ex) 테터

  실물 자산을 기준으로 가격이 변동되는 암호화폐

  법정통화 담보, 유명 코인 담보, 아무것도 x (이건 위험도 큼)

  거래소에서 주로 사용

  cbdc : 국가가 만들어내는 법정통화 (스테이블과 비슷하나 다름)

- Gas : 수수료

- ERC : 이더리움에서 사용 가능한 토큰의 표준

- 노드(퍼블릭) == 피어(프라이빗)



### 합의 알고리즘

1. 작업증명 (PoW) : 문제를 푸는 사람에게 블록 만들 수 있는 기회 부여

   비트코인에서 사용하는 방식

   동시에 문제를 해결한다면 두개로 분기

   다음 마이닝을 통해 가장 긴 체인이 정당성 부여 받음 (***이중 지불 방지*** )

   코인의 수를 관리 (10분에 하나) => 컴퓨터 처리 능력이 올라가면 문제 난이도를 높여 10분으로 맞춤

   ***장)*** 보안 : 누가 블록을 만드는지 모르게, 위변조가 불가능

   ***단)*** 불필요한 에너지 사용이 많음

   51%의 공격 : PoW의 경우 악의적인 참여자가 절반 이상의 해시파워를 가지게 된다면 블록의 내용이 조작 가능

   (비트코인은 많은 사람이 참여하기 때문에 거의 불가능하지만 신흥 코인은 가능함)

2. 지분증명 (PoS) : 지분에 따라 블록을 만들 수 있는 기회 부여

   이더리움에서 사용하는 방식

   ***장)*** 에너지 효율적인 측면에서 이득

   ***단)*** 빈익빈 부익부, 보안 : 기존의 IT보다는 우수하지만 지분의 양만큼 무작위기 때문에 예측가능하다는 점이 PoW보다 보안성 낮음

   문제점 : 참여한 노드들이 이자를 받으려고 코인을 묶어두려할 경우 : 시중의 유통량 감소로 이어질 수 있음

   + BFT 기반 PoS : 3N+1 개의 노드가 있어야 비잔틴 장군 문제 해결 가능

     프라이빗 네트워크에서 사용

     IoTA에서 가능함 (소규모 네트워크)

     비트코인은 거의 불가능 (노드가 너무 많기 때문에)

3. 위임증명 (DPoS) : 대표를 투표를 해서 그들 사이에서 기회 부여

   라운드 로빈 방식으로 블록 생성

   특정 인원에게만 권한 위임

   위임 대표자와 수익 배분

   분산화를 줄일 수 있다 (공유경제의 목적성과 달라질 수 있다)

   문제점

   ​		1. 위임자를 잘 선택해야함 (올바른 대표자 선출을 위해 누군지 밝혀야 함)

   ​		2. 대표자 네트워크 공격

   ​		3. 투표 불이행 등. 



### 대칭키 

암/복호에 동일한 키 사용 (AES,DES)

키 분배의 어려움

속도 빠름

서명 불가능 



### 공개키

암/복호에 서로 다른 키

개인키를 비밀로 유지, 공개키 공개

받는 사람의 공개키로 암호화

디지털 서명가능 (내 개인키로)

공개키로 개인키 알 수 없지만 개인키로는 공개키 알 수 있음



### 해쉬함수

해쉬로 역으로 원 데이터 찾아가는 것은 불가능

무결성 기능 : 해시값 보내서 사용자의 해시값 비교해서 무결성 검증 

해쉬기반의 작업증명 : N개의 0으로 시작하는 출력값을 찾아야함



#### 새로운 블록을 만드는 알고리즘

1. 이전 블록 해쉬값 확인
2. 랜덤한 논스를 이용하여 새로운 블록 만듦
3. 새로운 블록을 해쉬함
4. N개의 0로로 시작? 모두에게 블록 알림 : 2로 올라감



